extends Node


var game_word : String
var words_list : Array = ["نمایش", "روایت", "درمان", "شهران", "همایش", "اشکان", "کوروش", "شمارش", "سلامت", "بهینه", "ضربان", "خواهر", "میزان", "ترازو", "میانه", "مبانی", "مقدمه", "اشکال", "طاقچه", "رنگین", "ترمیم", "پرنده", "زنگار", "سردار", "سرباز", "سروان", "سرهنگ", "برهنه", "برهان", "بحران", "افشار", "اشراف", "افسار", "افشان", "اسکان", "اقساط", "الوار", "اخبار", "هکتار", "نکتار", "کافور", "پیرزن", "کانون", "قانون", "سندان", "سنگین", "پیشرو", "رضایت", "شرافت", "معرفت", "اسارت", "مغفرت", "ظرافت", "فرزاد", "فرزین", "محمود", "مجتبی", "مصطفی", "افطار", "مکتوب", "مقبول", "مقتول", "مذکور", "منظوم", "منصور", "نظامی", "کلامی", "خرافه", "کمانه", "سرانه", "شکاری", "شاهین", "قزوین", "تهران", "کنکور", "ستایش", "نیایش", "مبارز", "تابوت", "تورات", "انجیل", "کشمیر", "نومید", "حکومت", "شقاوت", "طبابت", "اسلام", "سینما", "مبینا", "قاهره", "شماتت", "قصابی", "قضاوت", "سیمین", "ارشیا", "اورنگ", "قربان", "زنبور", "چنگیز", "قلندر", "غضنفر", "بیکار", "پرکار", "پرورش", "آموزش", "تدریس", "تبخیر", "تقطیر", "میعان", "چگالش", "فرازش", "تصعید", "آسوده", "آسمان", "آتشین", "آواره", "آوازه", "آبادی", "آبگیر", "حسابی", "غضروف", "قابله", "حامله", "قابیل", "هابیل", "گرگان", "گیلان", "ایران", "انگار", "انبار", "انجیر", "بیلچه", "بادام", "نادان", "جهالت", "دستار", "لیوان", "وانیل", "دامان", "دامنه", "کلیله", "کلیسا", "جماعت", "مدینه", "سامرا", "مولوی", "هشیار", "همیار", "همسان", "همکار", "شراکت", "شفاعت", "شباهت", "تفاوت", "تصادف", "حادثه", "سانحه", "سابقه", "بارقه", "عاطفه", "همیشه", "مانکن", "خندان", "خواهش", "خاستن", "آفتاب", "مهتاب", "شبتاب", "فاطمه", "عبادت", "عبارت", "اشاره", "مناره", "زمانه", "گردنه", "دوران", "آرمان", "پیروز", "فیروز", "قمپوز", "کمبزه", "خربزه", "جربزه", "جوانک", "توانا", "عریضه", "قرنیه", "عنبیه", "شبکیه", "رابطه", "ضابطه", "قاعده", "تکانه", "نگارش", "تراوش", "تکامل", "تلاطم", "طوفان", "کارون", "محترم", "مملکت", "تنبور", "سنتور", "گیتار", "باران", "وارون", "سامان", "بازار", "دیوار", "شیپور", "وادار", "رادار", "کشتار", "کفتار", "کردار", "پندار", "غربال", "بردار", "سفینه", "ماشین", "منگنه", "کبکبه", "دبدبه", "ستاره", "سیاره", "مشتری", "بربری", "نانوا", "وکالت", "حماقت", "بلاهت", "باتوم", "شلخته", "گسسته", "هندسه", "ریاضی", "ریاضت", "زیتون", "فارسی", "خارجی", "داخلی", "دخالت", "صداقت", "مصداق", "مرداد", "پاییز", "بهاره", "کرامت", "کاسبی", "تکبیر", "تخمیر", "مشروب", "نوشتن", "خوانا", "روانی", "کنگره", "سماور", "یخچال", "فریزر", "فروتن", "فواره", "کفایت", "غیبگو", "تربیت", "طراوت", "ترکمن", "زنبیل", "زنجان", "دلالی", "پزشکی", "دلاور", "تکاور", "تقاطع", "تفاهم", "صبوری", "شکیبا", "اثبات", "مقطوع", "هزینه", "طریقه", "سنجاق", "قبیله", "غریبه", "معروف", "مشهور", "شهامت", "مجاور", "مخالف", "موافق", "مبارک", "مسافر", "سفارت", "مدافع", "افاقه", "عمامه", "اراده", "جواهر", "کواکب", "مفاسد", "فراغت", "دایره", "سربند", "خرسند", "دندان", "فرمان", "دستور", "صندلی", "تافته", "بافتن", "شناور", "شکایت", "کراهت", "راهبه", "اقشار", "ایثار", "رخسار", "پرواز", "تاپیک", "طاغوت", "کاشان", "نیمکت", "یکدست", "تکفیر", "کمینه", "ماجرا", "تبریز", "تداوم", "نارون", "نباتی", "یاسین", "پرهام", "گرانش", "گرایش", "مرضیه", "دریچه", "جریحه", "گلابی", "میراث", "خیانت", "صومعه", "مراکش", "مرداب", "نوشین", "ریزان", "بادیه", "بریدن", "تبریک", "حنجره", "درپوش", "ضعیفه", "درپوش", "میدان", "مقدار", "گیومه", "تکذیب", "سیلاب", "سوریه", "کدورت", "تبعید", "دودزا", "چمران", "آفرود", "افسوس", "اشغال", "اعمال", "شهناز", "قاجار", "بیمار", "بیتاب", "پرگار", "پروین", "برزین", "زبرین", "زیرین", "آذرین", "مراسم", "مقارب", "ملازم", "معاند", "مکارم", "اسالم", "امکان", "مرغوب", "مشروع", "مشروط", "مشکوک", "منشور", "مستور", "تصویر", "توضیح", "توجیه", "ترجیح", "متوجه", "تواضع", "اجابت", "اجاره", "مرجوع", "ارجاع", "اغفال", "اسکار", "اشکنه", "مقبره", "زمینه", "مسواک", "راکون", "کابین", "پوشال", "پوران", "ممنوع", "مختوم", "احسان", "اجبار", "جایزه", "منجیل", "پنچری", "پنجره", "همدان", "سمنان", "عکاسی", "نقاشی", "نقاله", "مقاله", "مقابل", "نگاره", "عمارت", "آبنوس", "سوهان", "فوریت", "فوریه", "عصاره", "جمجمه", "قمقمه", "قشقرق", "چکاوک", "چپاول", "عطاوک", "عطاری", "عطارد", "سمسار", "مجاهد", "خلیفه", "شماره", "جراحی", "آسایش", "آرامش", "کنعان", "کهریز", "پرویز", "فرشید", "فرشاد", "فرانک", "فرغون", "شهرام", "کلافک", "کلافه", "سیامک", "صیانت", "سماجت", "جریمه", "نتیجه", "نبیره", "ندیده", "نواده", "خزانه", "خزینه", "سرویس", "نزاکت", "نظافت", "نفوذی", "مرتبه", "محکمه", "مرحله", "مضحکه", "شایعه", "شاتره", "شاتوت", "باروت", "گفتار", "گلنار", "کتیبه", "کفاره", "جنازه", "شناسه", "سکسکه", "ساجده", "آمیگا", "سلیطه", "تبصره", "عافیت", "مصیبت", "ماجده", "مقداد", "دهانه", "ذکاوت", "ذخیره", "زهتاب", "کمانک", "گرامی", "جاساز", "جزیره", "جکوزی", "نوکیا", "نوکری", "ارباب", "افترا", "توهین", "توبیخ", "تاراج", "تعبیه", "تامین", "تسکین", "کاذیه", "پهپاد", "ایمان", "آشکار", "شاپرک", "تمسخر", "مسخره", "شمشیر", "تکثیر", "تلمیح", "کنایه", "ضمیمه", "شماته", "حماسه", "حراست", "حفاظت", "توافق", "تشابه", "تجانس", "کفاشی", "قلابی", "زرافه", "روباه", "خرگوش", "تمساح", "حاشیه", "بالین", "نارنج", "پرتاب", "پرچین", "چرکین", "پردیس", "دوتار", "تاریک", "تاریخ", "آبتنی", "درویش", "دهبان", "دهقان", "چندان", "چنگال", "پارسا", "سرطان", "سلطان", "بستان", "همستر", "مورچه", "کروکی", "کفگیر", "نفربر", "رفوزه", "هشتپر", "سیفون"]


var daily_words_list = []
var daily_words_done = []
var daily_guessed_words = []
var music_volume_value = 0.5
var sfx_volume_value = 0.5


var is_from_levels := false
var level : int
var max_level_count = 20
var high_score := 0
var energy = 4


var last_day = -1
var day : int
var launch_unix = 1727987400
var current_unix


var completed_levels = []


enum GameModes {
	Endless,
	Levels,
	Daily
}
var current_gamemode


func _ready():
	seed(8)
	daily_words_list = words_list.duplicate()
	daily_words_list.shuffle()
	randomize()
	current_unix = int(Time.get_unix_time_from_system())
	day = (current_unix - launch_unix) / 86400
	print(day)


func set_game_word(from_button : int = -1):
	match current_gamemode:
		GameModes.Levels:
			level = from_button
			game_word = words_list[from_button - 1]
		GameModes.Endless:
			game_word = words_list.pick_random()
			return game_word
		GameModes.Daily:
			game_word = daily_words_list[day]


func add_completed_level():
	completed_levels.append(level)
	SaveManager.save_data()


func set_high_score(new_high_score):
	high_score = new_high_score


func set_gamemode(new_gamemode: GameModes):
	current_gamemode = new_gamemode
